20260111T220149--kdoc-524-jsxがどのようにjavascriptに変換されるかを見る__permanent.org
:properties:
:ID: 20260111T220149
:end:
#+title:      KDOC 524: JSXがどのようにJavaScriptに変換されるかを見る
#+date:       [2026-01-11 Sun 22:01]
#+filetags:   :permanent:
#+identifier: 20260111T220149

* この文書のステータス
- 作成
  - [X] 2026-01-11 貴島
- レビュー
  - [X] 2026-02-01 貴島

* 概要

Reactに対して、いまいち使いこなせていない感覚を感じつづけてきた。その理由の1つは、JSXを理解してないことに見える。明らかにJavaScriptとは違うのだが、混在して存在している。よくわかっていないので、確認することにした。

まず、JavaScriptとJSXの関係すら怪しかった。JSXは拡張構文である。

#+begin_quote
[[https://ja.wikipedia.org/wiki/JSX_(JavaScript)][JSX (JavaScript) - Wikipedia]]

JSX (JavaScript XML, formally JavaScript Syntax eXtension) は、 JavaScript に XML のような文法が拡張された言語である。
#+end_quote

じっさいに変換してみて確認する。

#+caption: JavaScriptに変換してみる
#+begin_src shell
cat << 'EOF' | npx -y esbuild --loader=jsx --format=cjs 2>&1
/* HTMLタグ */
<div>
  <h1>hello</h1>
</div>;

/* コンポーネント */
<Provider store={store}>
  <App />
</Provider>;

/* JSXとJavaScriptの混在 */
const jsx1 = <Component />;

/* 三項演算子 */
1 ? <p>a</p> : <p>b</p>

/* 比較演算子とJSXが区別される */
1<0>2;

EOF
#+end_src

#+RESULTS:
#+begin_src
/* @__PURE__ */ React.createElement("div", null, /* @__PURE__ */ React.createElement("h1", null, "hello"));
/* @__PURE__ */ React.createElement(Provider, { store }, /* @__PURE__ */ React.createElement(App, null));
const jsx1 = /* @__PURE__ */ React.createElement(Component, null);
1 ? /* @__PURE__ */ React.createElement("p", null, "a") : /* @__PURE__ */ React.createElement("p", null, "b");
1 < 0 > 2;
#+end_src

#+caption: loaderにjsxがない場合はJSXシンタックスのパースに失敗する
#+begin_src shell :results print
cat << 'EOF' | npx -y esbuild --format=cjs 2>&1
<h1>hello</h1>

EOF
#+end_src

#+RESULTS:
#+begin_src
✘ [ERROR] The JSX syntax extension is not currently enabled

    <stdin>:1:0:
      1 │ <h1>hello</h1>
        ╵ ^

  The esbuild loader for this file is currently set to "js" but it must be set to "jsx" to be able to parse JSX syntax. You can use "--loader:.js=jsx" to do that.

1 error
#+end_src

* 関連

なし。
