20260111T220149--kdoc-524-jsxがどのようにjavascriptに変換されるかを見る__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-14T18:31:07Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 524: JSXがどのようにJavaScriptに変換されるかを見る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 524: JSXがどのようにJavaScriptに変換されるかを見る</h1>
<div id="outline-container-org034715b" class="outline-2">
<h2 id="org034715b"><a href="#org034715b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org034715b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-01-11 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-02-01 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfb9a034" class="outline-2">
<h2 id="orgfb9a034"><a href="#orgfb9a034">概要</a></h2>
<div class="outline-text-2" id="text-orgfb9a034">
<p>
Reactに対して、いまいち使いこなせていない感覚を感じつづけてきた。その理由の1つは、JSXを理解してないことに見える。明らかにJavaScriptとは違うのだが、混在して存在している。よくわかっていないので、確認することにした。
</p>

<p>
まず、JavaScriptとJSXの関係すら怪しかった。JSXは拡張構文である。
</p>

<blockquote>
<p>
<a href="https://ja.wikipedia.org/wiki/JSX_(JavaScript)">JSX (JavaScript) - Wikipedia</a>
</p>

<p>
JSX (JavaScript XML, formally JavaScript Syntax eXtension) は、 JavaScript に XML のような文法が拡張された言語である。
</p>
</blockquote>

<p>
じっさいに変換してみて確認する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>JavaScriptに変換してみる</label><pre class="src src-shell">cat &lt;&lt; <span class="org-string">'EOF'</span> | npx -y esbuild --loader=jsx --format=cjs 2&gt;&amp;1<span class="org-sh-heredoc">
/* HTML&#12479;&#12464; */
&lt;div&gt;
  &lt;h1&gt;hello&lt;/h1&gt;
&lt;/div&gt;;

/* &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488; */
&lt;Provider store={store}&gt;
  &lt;App /&gt;
&lt;/Provider&gt;;

/* JSX&#12392;JavaScript&#12398;&#28151;&#22312; */
const jsx1 = &lt;Component /&gt;;

/* &#19977;&#38917;&#28436;&#31639;&#23376; */
1 ? &lt;p&gt;a&lt;/p&gt; : &lt;p&gt;b&lt;/p&gt;

/* &#27604;&#36611;&#28436;&#31639;&#23376;&#12392;JSX&#12364;&#21306;&#21029;&#12373;&#12428;&#12427; */
1&lt;0&gt;2;

EOF</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">/* @__PURE__ */ React.createElement("div", null, /* @__PURE__ */ React.createElement("h1", null, "hello"));
/* @__PURE__ */ React.createElement(Provider, { store }, /* @__PURE__ */ React.createElement(App, null));
const jsx1 = /* @__PURE__ */ React.createElement(Component, null);
1 ? /* @__PURE__ */ React.createElement("p", null, "a") : /* @__PURE__ */ React.createElement("p", null, "b");
1 &lt; 0 &gt; 2;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>loaderにjsxがない場合はJSXシンタックスのパースに失敗する</label><pre class="src src-shell">cat &lt;&lt; <span class="org-string">'EOF'</span> | npx -y esbuild --format=cjs 2&gt;&amp;1<span class="org-sh-heredoc">
&lt;h1&gt;hello&lt;/h1&gt;

EOF</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">✘ [ERROR] The JSX syntax extension is not currently enabled

    &lt;stdin&gt;:1:0:
      1 │ &lt;h1&gt;hello&lt;/h1&gt;
        ╵ ^

  The esbuild loader for this file is currently set to "js" but it must be set to "jsx" to be able to parse JSX syntax. You can use "--loader:.js=jsx" to do that.

1 error
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb12e16c" class="outline-2">
<h2 id="orgb12e16c"><a href="#orgb12e16c">関連</a></h2>
<div class="outline-text-2" id="text-orgb12e16c">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
